---
kind: method
id: M:Autodesk.Revit.DB.Analysis.SpatialFieldManager.GetLegend
source: html/c679eb34-4440-8d0c-d0c7-ffeb6e3d5eee.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldManager.GetLegend Method

Returns legend element or NULL

## Syntax (C#)
```csharp
public AnalysisDisplayLegend GetLegend()
```

## Returns
The legend element or NULL